Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.




Решение:
Я решил эту задачу с помощью первоначального ввода массива с клавиатуры.

Создается массив string[] arry в который пользователь с помощью клавиатуры вводит общее количество элементов.
Количество сохраняется в переменную  int ElementCount. По умолчанию массив заполнен нулями. Нам нужно заполнить его элементами, введенными с клавиатуры. Для этого создается метод completionMassive.

Метод completionMassive, который ничего не возвращает, а работает с созданным массивом, принимает на вход массив с типом данных string и количество элементов (int ElementCount) в массиве тип данных int

void completionMassive(string[] Arry, int ElementCount)    
{
    for (int i = 0; i < ElementCount; i++)                   
    {
        Console.Write("Введите элемент массива: ");
        Arry[i] = Convert.ToString(Console.ReadLine());
    }
}
С помощью цикла for, переменной/счетчика i, считывания с консоли (Console.ReadLine) и преобразование введенного символа с клавиатуры в тип string (Convert.ToString), в итоге получаем массив string[] arry типа string, где количество элементов и символы ввёл пользователь с клавиатуры.
Выводим на печать получившийся массив string[] arry.

Далее нужно создать новый массив и по условиям задачи он должен быть заполнен любыми символами из массива string[] arry.
Длинна нового массива должна быть в диапазоне от 0 до 3 символов включительно.

Для этого испозьзуем новый метод newElementsMassive().
Этот метод возвращает массив типа данных string. На вход принимает массив string[] arry типа данных string.

string[] newElementsMassive(string[] Arr)
{
    Random random = new Random();                       
    string[] newMas = new string[random.Next(0, 4)];
    for (int i = 0; i < newMas.Length; i++)          
    {
        newMas[i] = Arr[random.Next(0, Arr.Length)];    
    }
    return newMas;
}
В методе инициализируется генератор случайных чисел Random random = new Random().
Создается новый массив string[] newMas типа данных string. По умолчанию массив заполнен 0. 
Так как по условии задачи длинна нового массива должна быть от 0 до 3 элементов, поэтому воспользуемся генератором случайных чисел с диапозоном от 0 до 4 (так как этот генератор не включает правое число в диапазон, т. е. он возьмет от 0 до 3 включительно) и поставим его в скобки, где указывается количество элементов в новом массиве string[] newMas.Таким образом при каждом новом запуске программы мы будем получать разную длинну нового массива string[] newMas.

Теперь нужно скопировать элементы из первого массива string[] arry в новый массив string[] newMas. Для этого используем цикл for, перемнную/счетчик i. По элементно скопируем в новый массив string[] newMas  элементы  из массива string[] arry.
и для того,чтобы эти элементы были выбраны случайным образом, нужно воспользоваться генератором случайных чисел  Random random = new Random() с диапозоном от 0 до всей длинны массива string[] arry, что позволит выбрать по индексу случайный элемент из массива string[] arry при каждом новом запуске программы.


Выводим на печать новый получившейся массив string[] newMas.





